{
    "name": "Life",
    "image_url": null,
    "image_caption": "Caption Comes here",
    "children": [
    {
        "name": "Archaea",
        "image_url": null,
        "image_caption": "Caption comes here!"},
    {
        "name": "Bacteria",
        "image_url": null,
        "image_caption": "Caption comes here!",
        "children": [{
            "name": "Yogurt",
            "image_url": "img/bacteria.jpg",
            "image_caption": "2018-07-09<br>37°33'42.0''N 122°19'19.3''W (San Mateo, CA, USA)<br><br>This is a noosa pear and cardamom flavored yoghurt. Bacteria found in yogurt are called probiotics and usually comes in the form of streptococcus thermophilius and lactobacillus bulgaricus. These bacteria in the yogurt are used to ferment milk. This yogurt is white, sweet, and creamy. On the bottom of the yogurt, there is a fruit puree of pear and cardamom creating a fruity and tart taste."
            }]
    },  {
        "name": "Eukarya",
        "image_url": null,
        "children": [
          {
            "name": "Protist",
            "image_url": null,
            "image_caption": "Caption comes here!",
            "children": [{
                "name": "Algae",
                "image_url": "img/algae.jpg",
                "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA<br><br>This protist is located in one of the tanks in the aquarium of the California Academy of Sciences. These protists are multicellular and as kelp or seaweed, they produce oxygen, food, and shelter for the many marine organisms living in the aquarium. It has a greenish color due to chlorophyll, which helps the protist during photosynthesis in order to produce more. This protist had uneven texture and a zigzag on its outside. "
            }]
        }, {
            "name": "Fungi",
            "image_url": null,
            "image_caption": "Caption comes here!",
            "children": [
              {
                "name": "Example 1",
                "image_url": "img/fungi1.jpg",
                "image_caption": "2018-06-12<br>37°33'42.0''N 122°19'19.3''W (San Mateo, CA, USA)<br><br>The fungi shown in this picture is mold. This mold was found in the mochi I brought back from my trip in Japan. The mold has a greenish-white color and is scattered all around the mochi, growing in bunches and colonies. "
              },
              {
                "name": "Example 2",
                "image_url": "img/fungi2.jpg",
                "image_caption": "2018-07-15<br>37°33'42.0''N 122°19'19.3''W (San Mateo, CA, USA)<br><br>The fungi shown in this picture is a wild mushroom I found in a planter on my front porch. It was very small, with only about 1~1.5 inches in length. The head of the mushroom was brown and a little cracked while the stalk of the mushroom was white. "
              },
              {
                "name": "Example 3",
                "image_url": "img/fungi3.jpg",
                "image_caption": "2018-07-25<br>37°33'42.0''N 122°19'19.3''W (San Mateo, CA, USA)<br><br>This is a quarter circle of bleu cheese I found in my refrigerator. The bleu cheese is mainly white but has many greenish blue colored holes, which is the fungus found in the cheese called Penicillium roqueforti. This cheese also smells like a fungus, a little bit like feet. The cheese is also very soft and easily crumbled.  "
              }
          ]
        },
        {
            "name": "Plantae",
            "image_url": null,
            "image_caption": "Caption comes here!",
            "children": [
            {
              "name": "Bryophyta",
              "image_url": "img/bryophyte.jpg",
              "image_caption": "2018-06-30<br>37°33'42.0''N 122°19'19.3''W (San Mateo, CA, USA)<br><br>This is moss that I found on a log displayed on a window at my house. The moss is very short (only about 1cm in length) and light green and fuzzy. Bryophytes are vascular land plants that do not have seeds, so they reproduce by spores. The moss is bunched up in sections along the log, preferring darker and more moist environments, but can thrive without many resources."
            },
            {
              "name": "Pterophyta",
              "image_url": null,
              "image_caption": "Caption comes here",
              "children": [
                {
                  "name": "Example 1",
                  "image_url": "img/fern1.jpg",
                  "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA<br><br>This is a fern found in the entrance of the California Academy Of Sciences. It is called the Western Sword Fern. The ferns are found in bunches and groups of many ferns. In the middle there is a fiddlehead, or a baby fern. The ferns on the top seem to have a lighter green color than the ferns on the bottom. Each frond on the fern also has a zig-zagged texture and is attached to a large stem.The fronds are about 2 to 3 inches in length.  "
                },
                {
                  "name": "Example 2",
                  "image_url": "img/fern2.jpg",
                  "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>This second fern is called the Ostrich Fern. It is a lot more feathery than the Western Sword Fern. This fern was much taller and almost as tall as a tree. The photo is part of the fern branch of the Ostrich Fern. The fern also tapered at the end and looked a little wavy. The tip of the bottom of the fern was a yellow brownish color. The fronds are about 3 to 4 inches in length.  "
                },
                {
                  "name": "Example 3",
                  "image_url": "img/fern3.jpg",
                  "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>This last fern is found in the rainforest cylinder in the California Academy Of Sciences. Its fronds and entire leaf structure is bigger than the other two ferns. The fern looks like it is casting shade over the organisms of the rainforest in order to help cool them. The fronds are about 10~12 inches in length. "
                }
              ]
            },
            {
              "name": "Ginkgophyta",
              "image_url": "img/ginkgo.jpg",
              "image_caption": "2018-07-22<br> Central Park 50 E 5th Ave, San Mateo, CA, USA<br><br>This ginkgo tree is located in the entrance of San Mateo’s Central Park Japanese Tea Garden. Ginkgos are non-flowering plants that have fan-shaped leaves usually in either a yellow or green color. In the picture above the leaves are green as it is the summer season and photosynthesis is happening. As fall approaches, however, the leaves will turn into a beautiful golden color. The leaves are about 1 inch in length and have a thin stem that branches off from the main branch."

            },
            {
              "name": "Coniferophyta",
              "image_url": null,
              "image_caption": "Caption comes here",
              "children": [
                {
                  "name": "Example 1",
                  "image_url": "img/conifer1.jpg",
                  "image_caption": "2018-07-02<br>900 Alameda de las Pulgas, San Mateo, CA, USA<br><br>This is one of the conifers found on Aragon’s campus. The needles are very short, on average about 1~1.5inch length and are also segmented, rough in texture and look a little bit like centipedes. The needles are bunched up at the end of the tree, perhaps in order to protect the center of the tree from wind or harmful bacteria. There were also some tiny white buds at the end of some of the needles, which probably means that new needles will grow.  "
                },
                {
                  "name": "Example 2",
                  "image_url": "img/conifer2.jpg",
                  "image_caption": "2018-07-02<br>900 Alameda de las Pulgas, San Mateo, CA, USA<br><br>Conifers are gymnosperms and they are seed plants that reproduce using cones. In this example, the female cones are large (since they hold all the seeds) while the male cones are smaller but more bunched up together.The male cones have pollen (sperm) that is waiting to be blown away by the wind so that it can fertilize the female cones. These female cones are rather big in length, about ½ of a foot, compared to the other conifers cones.They are located throughout the tree branches and have opened up which means that they have been fertilized. The male cones, however, are at the very end. The needles had an average length of about 3~4 inches. "
                },
                {
                  "name": "Example 3",
                  "image_url": "img/conifer3.jpg",
                  "image_caption": "2018-07-23<br>444 S El Camino Real, San Mateo, CA, USA<br><br>This conifer is one found in front of a bank near my house. This conifer isn’t on a tree, but rather in a bush-like structure. Its pine needles are long and pointy, about ½ a foot in length. In a conifer, there are male and female cones. The male cones are small, numerous and bunched together in the front of the picture. They contain pollen which will later fertilize the female cone. The female cone, on the other hand, are big and much less in number compared to the male cones. They are wide and open. The conifer is also covered with spider webs, which means it must make a habitat for many organisms. "
                }
              ]
            },
            {
              "name": "Anthophyta",
              "image_url": null,
              "image_caption": "Caption here",
              "children":[{
                "name": "Monocot",
                "image_url": null,
                "image_caption": "Caption comes here!",
                "children": [
                  {
                    "name": "Example 1",
                    "image_url": "img/monocot1.jpg",
                    "image_caption": "2018-06-09<br>Japan, 〒503-0312 Gifu-ken, Kaizu-shi, 平田町三郷1980<br><br>This is one of my grandma’s pink lilies. It has 6 bright pink petals and its leaves have parallel veins, which means that this flower is a monocot. The petals curl a little bit outwards, probably to absorb the most amount of sunshine possible.  It has 5 thin and long stamen and 1 pistil which are heavily pollinated in the middle. The lily has one long stem that’s about 1~1.5 feet tall."
                  },
                  {
                    "name": "Example 2",
                    "image_url": "img/monocot2.jpg",
                    "image_caption": "2018-06-09<br>Japan, 〒503-0312 Gifu-ken, Kaizu-shi, 平田町三郷1980<br><br>This is an iris I found in my grandma’s garden. It had 6 petals with 3 on top and 3 on the bottom. The veins on the leaves are also parallel and it looks like the flower also has a parallel veined pattern. This purple iris was blooming at about a foot high off the ground. "
                  },
                  {
                    "name": "Example 3",
                    "image_url": "img/monocot3.jpg",
                    "image_caption": "2018-07-09<br>37°33'42.0''N 122°19'19.3''W (San Mateo, CA, USA)<br><br>This is a flower I found in my front yard. Its leaves had parallel veins and were about 6~8 inches long, which means that the flower is a monocot. The plant itself was about 4 feet of the ground. Most of the flower petals came in groups of 3 although many flowers had lost their petals due to wind and other environmental factors."
                  }
                ]},
                {
                "name": "Dicot",
                "image_url": null,
                "image_caption": "Caption comes here!",
                "children": [
                  {
                    "name": "Example 1",
                    "image_url": "img/dicot1.jpg",
                    "image_caption": "2018-06-09<br>Japan, 〒503-0312 Gifu-ken, Kaizu-shi, 平田町三郷1980<br><br>This is one of the flowers found at my grandma’s house. There were about 10 other roses in the bunch. The flower has multiple bright red color petals and its leaves have net patterned veins, which means that this flower is a dicot. The leaves are sharp and zigzagged. This rose is also facing the natural sunlight, responding to the environment. Some leaves have gaps which is evidence that there are organisms that feed on this plant."
                  },
                  {
                    "name": "Example 2",
                    "image_url": "img/dicot2.jpg",
                    "image_caption": "2018-06-09<br>Japan, 〒503-0312 Gifu-ken, Kaizu-shi, 平田町三郷1980<br><br>This is a tomato plant I found in my grandma’s garden. The tomato flower is a dicot because its petals are arranged in patterns of 5 and its veins have a net-like pattern . Tomato flower petals are very small and yellow, each probably 1~2 cm in length. The stem of the plant is fuzzy, probably used as protection. "
                  },
                  {
                    "name": "Example 3",
                    "image_url": "img/dicot3.jpg",
                    "image_caption": "2018-06-09<br>Japan, 〒503-0312 Gifu-ken, Kaizu-shi, 平田町三郷1980<br><br>This is a group of carnations I found in my grandma’s garden. Carnations are all angiosperms that have net-like veins in its leaves and pink petals that comes in groups of 4 or 5. The petals come in this bright color in order to attract the many insects that pollinate the plant. "
                  }
                ]

              }]


            }
        ]
    },
    {
        "name": "Animalia",
        "image_url": null,
        "image_caption": "Caption comes here!",
        "children": [
        {
          "name": "Porifera",
          "image_url": "img/sponge.jpg",
          "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>This is a sponge found in the aquarium in the California Academy Of Sciences. The yellow sponge is covered with many spores; it looks like a regular kitchen sponge. These sponges are stationary; they stick onto a surface and don’t move.  "
        },
        {
          "name": "Cnidaria",
          "image_url": "img/jellyfish.jpg",
          "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>These cnidaria are called moon jellies. Compared to other kinds of jellyfish, these one have shorter tentacles (cilia).  On the front, moon jellies have a 4 leaf clover shape. These jellyfish are boneless so they can move freely around in the water. They mainly move by pushing through the cilia up. They also tend to move in groups. Moon jellies are transparent and they change color as the lights in the tank change. Their color can also be slightly determined based on the food their diet. If they feed mainly on crustaceans, they would have a pinkish color, while if they feed mainly on shrimp they would have an orangish color. "
        },
        {
          "name": "Platyhelminthes",
          "image_url": "img/tapeworm.jpg",
          "image_caption": "2018-07-24<br> 819 S B St, San Mateo, CA, USA <br><br>This is a tapeworm sample found in the Aragon Veterinary Clinic. Though it’s a little hard to see, the tapeworm is the clear white spring-like organism you can see inside the liquid. This tapeworm was a little more short, but the veterinarian said that they could grow up to 5ft. The tapeworm is a type of parasitic worm, evident with the dangerous symbol on the container. "
        },
        {
          "name": "Nematoda",
          "image_url": "img/heartworm.jpg",
          "image_caption": "2018-07-24<br> 819 S B St, San Mateo, CA, USA <br><br>These are the heartworms, a parasite that can be found in the hearts of dogs. Heartwroms can be found in an enclosed container at the Aragon Veterinary Clinic. These heartworms are white, short, skinny, and stringy and they look like a little uncooked, raw pasta.  "
        },
        {
          "name": "Annelida",
          "image_url": "img/leech.jpg",
          "image_caption": "2018-07-29<br>37°33'42.0''N 122°19'19.3''W (San Mateo, CA, USA)<br><br>This is a leech I found under a plant in my front yard. It is an annelid because you could see the segments on the leech’s body. The leech was a black color and on one side it had a sucking type of mouth and on the other was a skinny tail-like structure. The leech was soft and slimy in texture and was about 2~3 cm in length. It moved slowly in the soil and did not respond when in light.  "
        },
        {
          "name": "Mollusca",
          "image_url": "img/snail.jpg",
          "image_caption": "2018-06-09<br>Japan, 〒503-0312 Gifu-ken, Kaizu-shi, 平田町三郷1980<br><br>This mollusc is a snail that was on a flower at my grandma’s house. It has a hard brown calcium-carbonate shell to protect its soft and delicate body. The snail is holding onto the petal of the flower using the bottom of its body, or “foot”. The size of the mollusc is about 3 cm in length. When it sees predators or is in daylight, the snail crawls under its shell as a form of protecting itself, which is what it is doing in the picture. "
        },
        {
          "name": "Arthropoda",
          "image_url": null,
          "image_caption": "Caption here",
          "children": [
            {
              "name": "Crustacea",
              "image_url": null,
              "image_caption": "Caption here",
              "children": [
                {
                  "name": "Example 1",
                  "image_url": "img/shrimp.jpg",
                  "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>These are shrimps exhibited at the California Academy Of Sciences. They have four pencil-thin legs and 2 very long whiskers and seem to be walking gracefully across the sand. They all have a reddish-pinkish color and have 2 black eyes on the top of their heads. Their bodies are segmented: head, body, tail, with the body being divided in segments. The shrimp’s body also narrow as it gets closer to the top. The organism looks as though it is smooth and maybe slimy. "
                },
                {
                  "name": "Example 2",
                  "image_url": "img/crustacea2.jpg",
                  "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>This is a hermit crab found in one of the tanks in the aquarium in the California Academy Of Sciences. The hermit crab is very small only about 2 cm in size. Its shell is white, while the rest of its body is a reddish orange color. They have many legs (10 to be exact) and walk by moving them back and forth. The legs have a zig-zagged texture, probably to make it easier for the crab to walk back and forth. "
                }
              ]
            },

            {
              "name": "Arachnea",
              "image_url": null,
              "image_caption": "Caption here",
              "children": [
                {
                  "name": "Example 1",
                  "image_url": "img/spider.jpg",
                  "image_caption": "2018-06-06<br> Arimacho, Kita, Kobe, Hyōgo 651-1401, Japan <br><br>This is a spider I found on a hike in Japan. It was a pretty small spider (about 3 cm in length) but had a large, delicate web surrounding it. It used its web to catch gullible prey that passed by. The spider had a brownish, reddish color and was holding onto the web using its long hind legs. It’s outward appearance seemed smooth rather than fuzzy. "
                },
                {
                  "name": "Example 2",
                  "image_url": "img/spider2.jpg",
                  "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>This is a black widow spider found in a small tank in the Academy Of Sciences. Since it is in the class Arachnea, the spider has 8 legs and 2 fang like structures. It was about 4~5 cm in length and the texture seemed very smooth. The spider has a dark, pitch black color, hence the name, the black widow spider. The black widow was still on a branch perhaps waiting for prey to pass by.   "
                }

              ]
            },
            {
              "name": "Insects",
              "image_url": null,
              "image_caption": "Caption here",
              "children": [
                {
                  "name": "Example 1",
                  "image_url": "img/insect1.jpg",
                  "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>These are some crickets I found in the frog exhibit at the California Academy Of Sciences. They are used as food for the frog. These crickets are about 2~4 cm in length and had a brownish color. They all had 2 pretty long antennae and 6 legs. The crickets body are are clearly divided into a head, body, and abdomen. The body is also divided up into segments. "
                },
                {
                  "name": "Example 2",
                  "image_url": "img/insect2.PNG",
                  "image_caption": "2018-07-23<br> Bay Tree Park 150 Dartmouth Rd, San Mateo, CA, USA <br><br>This is a bee I found in a park near my house. The yellow and black bee was pollinating a pink-white flower. Like many insects, the bee had 6 legs. It also had 2 antennae and some pollen stuck on its legs, probably from pollinating another flower. The bee’s movements were quick and jumping around the flower.  "
                }
              ]
            }

          ]

        },
        {
          "name": "Echinodermata",
          "image_url": "img/starfish.jpg",
          "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>These are the sea stars located in the California Academy of Sciences. They all have 5 arms and are characterized to have radial symmetry. Underneath a sea star, there are many projections that help the echinoderm move and attach onto different surfaces. In the picture above, the sea star is using the many tiny suction cups on the bottom of its arms in order to attach onto the glass wall in the aquarium.  "
        },
        {
          "name": "Chordata",
          "image_url": null,
          "image_caption": "Caption comes here",
          "children": [
            {
              "name": "Mammalia",
              "image_url": null,
              "image_caption": "Caption comes here ",
              "children": [
                {
                "name": "Example 1",
                "image_url": "img/cat.jpg",
                "image_caption": "2018-06-05<br> Arimacho, Kita, Kobe, Hyōgo 651-1401, Japan <br><br>This cat has a gorgeous golden, white, and black thick fur coat, used for protection from the environment. This mammal is very fat and seemed to be resting on a bench in front of the store. The cat has 4 legs, 2 front legs and 2 hind legs. It had 2 sets of thin, white whiskers coming from its nose and its ears were perked up. "
                },
                {
                "name": "Example 2",
                "image_url": "img/squirrel.jpg",
                "image_caption": "2018-07-22<br> Central Park 50 E 5th Ave, San Mateo, CA 94401 <br><br>This is a squirrel I found while on a walk in Central Park.  This mammal has a long bushy tail (about ¾ the length of its body), four paws, two marble black eyes, and two small ears. While the outside fur of the mammal is a brown, the inside fur of the mammal is white. The squirrel also had a set of thin, black whiskers coming from its nose. In its paws, the squirrel held a couple of leaves it grabbed from the grass beneath it.  "
                }
            ]},
            {
              "name": "Reptilia",
              "image_url": null,
              "image_caption": "Caption comes here ",
              "children": [{
                "name": "Example 1",
                "image_url": "img/reptile1.jpg",
                "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>This is an albino alligator found resting on a rock in the California Academy of Sciences. It had one large tail, 4 paws, and a large wide snout. The outside of the alligator looked very bumpy. It was probably around 10 ft in length and its teeth were coming out from its mouth. Its two eyes were located on top of its head, looking out for prey. "
              },
              {
                "name": "Example 2",
                "image_url": "img/turtle.jpg",
                "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>This is the spotted turtle spotted in the California Academy of Sciences. While its body was mainly a dark black color, its neck had some distinctive yellow spots. Its shell also has a repeated black hexagon pattern. The turtle had 4 legs that were half in the water, half in the land.  "
              }
            ]
            },
            {
              "name": "Amphibia",
              "image_url": null,
              "image_caption": "Caption comes here ",
              "children": [{
                "name": "Example 1",
                "image_url": "img/frog.jpg",
                "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>This is an amphibian called the green tree frog. It has a green body used to camouflage itself in its habitat. The green tree frog is smooth on the outside and has 4 webbed feet that have sticky toe pads making it easy to climb and attach to surfaces. This organism was about 1.5 inches in length. According to the description from the California academy of Sciences, the green tree frog seems to have a distinctive call. "
              },
              {
                "name": "Example 2",
                "image_url": "img/newt.jpg",
                "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>This is a yellow spotted newt. It’s outward appearance looked smooth and slimy and it was black with yellow spots throughout its body. This organism was about 3 to 4 inches in length and it loved being away from the light and under the rocks.  Even the tank had a red light rather than a bright white light in order to support the newt’s living habits. It was also very quick to move, which gives it good characteristics to catch prey fast.  "
              }
            ]
            },
            {
              "name": "Osteichthyes",
              "image_url": "img/fish.jpg",
              "image_caption": "2018-06-05<br> Arimacho, Kita, Kobe, Hyōgo 651-1401, Japan <br><br>These are the bony fish I found in a mini aquarium at a store in Japan. The fish came in many colors (red, gold, white) and their shape got thinner as the fish goes from head to tail. They usually had two fins: one one both sides. Its sides were covered with golden scales, which help the fish move up and down in the water, as they swim by waving their body back and forth. The fish’s eyes are also on the side indicating that they are a form of prey in a marine ecosystem. "
            },
            {
              "name": "Chondrichthyes",
              "image_url": "img/stingray.jpg",
              "image_caption": "2018-07-21<br> California Academy Of Sciences 55 Music Concourse Dr, San Francisco, CA, USA <br><br>Chondrichthyes are fish with a vertebrae and cartilage. An example found at the California Academy Of Sciences is the stingray. Though they look innocent, stingrays actually have a venom that can be deadly, according to the Academy Of Sciences. The stingray moved by waving its body back and forth in the water. However, this stingray was buried under the sand most of the time. Its tail was much longer than its body and tapered as it reached the end of the stingray. The tail was probably around 6~7 ft while the main body of the gray stingray was around 3~4ft. "
            }
          ]
        }

      ]
    }
  ]
  }
  ]
}
